README.org
#+TITLE: Astra Docs and Planning
#+DESCRIPTION: Astra is a mission control framework for KSP to facilitate fully automated missions and operations. Also hoping to learn a bit about control theory in the process.
#+AUTHOR: Tyler Weldon
#+EMAIL: tylerweldon94@gmail.com

* Astra :ATTACH:
** STRT R&D [2/2]
- [X] Can we set up a headless/graphically limited KSP?
  * +Running KSP in a VM seems promising.+
    * +Set all graphics settings to minimum+
  * We sure can! Unity options: ~~KSP.x86_64 -batchmode -nographics~~
- [X] If not headless, can we automate the launching of KSP "instances", and entering/setting up the game as desired(specific missions, locations, etc.) via the [[https://krpc.github.io/krpc/cpp/api/ui/ui.html][kRPC UI API]]?
  * +Might be able to use the Unity [[https://docs.unity3d.com/Manual/CLIBatchmodeCoroutines.html][Batch Mode]] and [[https://docs.unity3d.com/Manual/CommandLineArguments.html][nographics]] options to facilitate headless.+
  * +Will need some means of automatically launching specified game saves.+
    * +[[https://github.com/allista/AutoLoadGame][AutoLoadGame]] might do the trick.+
      * +Might modify to use Unity CLI args instead of config file:+
        + https://answers.unity.com/questions/138715/read-command-line-arguments.html
        + https://answers.unity.com/questions/366195/parameters-at-startup.html
  * No longer neccessary, headless is possible w/ unity opts in above task
** STRT Stage 1 - Prep [2/5]
  - [ ] Need to implement an automated Xvfb workflow using screenshots to debug Automation
    * +There are module load errors in KSP.log, not sure if its preventing AutoLoadGame from doing its thing, or if that is related to the Changelog startup dialog in KSP Main Menu.+ KSP 1.8.1 Works great
    * +Why are we stuck at the Change Log dialog on KSP Start?+ A bit annoying but appears to be inconsequential for my automation purposes.
      * ksp settings.cfg:
        * SHOW_WHATSNEW_DIALOG = False
        * +Version 1.7.3 was not honoring settings.cfg, lets see if 1.8.1 works+ Still not honored in 1.8.1 but again, appears inconsequential
  - [X] Automate game-archiver
  - [-] Base VM Image(Packer) [3/8]
    - [ ] astra-base.sfs
      * Might need to hop into a graphical run to get the minimal base + mods setup
    - [ ] AutoLoadGame.conf
    - [ ] settings.cfg
    - [ ] krpc-settings.cfg
    - [X] Install KSP 1.7.3 from S3
    - [-] Automate mod install [3/4]
      - [X] Install CKAN.deb
      - [X] kRPC manually from github
      - [X] AutoLoadGame - Allista
      - [ ] RO via CKAN
      - [ ] Principia
      - [ ] [[https://forum.kerbalspaceprogram.com/index.php?/topic/193933-110-kks-spacex-pack-july-06-2020/][KK's SpaceX Pack]]
    - [X] AutoLoadGame - Now supports specifying SFS files
    - [X] POC kRPC
  - [ ] Split Project into multiple repos [0/3]
    - [ ] Terraform [0/2]
      - [ ] Modules
      - [ ] Plans
    - [ ] Packer Base Image
    - [ ] Astractl
  - [X] Choose kRPC client language - C++
** TODO Stage 2 - Data [0/1]
- [ ] Set up client w/ all kRPC Data Stream - Once this is done, revisiting the image build will probably be worth it.
  * Pipe into GMAT and OpenMCT ???
** TODO Stage 3 - RL Software integrations [0/2]
- [ ] [[https://opensource.gsfc.nasa.gov/projects/GMAT/index.php][GMAT]] - Planning
- [ ] [[https://github.com/nasa/openmct][OpenMCT]] - Ops HUD
** TODO Stage 4 - Operations [0/2]
- [-] Starlink(s) [0/0]
- [-] Long running, real time ops [0/0]
** TODO Stage 5 - Stream Real Time Ops [0/0]
** KSP Mod Requirements
- [[https://github.com/allista/AutoLoadGame][AutoLoadGame]] - by Allista, allows creating a configuration file in your saves dir that will automatically load the specified sfs file upong game start.
- [[https://krpc.github.io/krpc/][kRPC]] - kRPC allows you to control Kerbal Space Program from scripts running outside of the game.
- [[https://github.com/KSP-RO/RealismOverhaul/wiki][Realism Overhaul]] - Its not certain this will place nice with [[https://krpc.github.io/krpc/][kRPC]], however realistic(ish?) control theory is really the purpose of this project so we will proceed with it until/unless we encounter problems.
- [[https://ksp-kos.github.io/KOS/][kOS]] - kOS might be useful for some simpler tasks where we don't want the full power of kRPC. Might use, might not. We'll see.
** On Hold
  - [ ] Properly version Packer builds
    - dev builds by commit short SHA
    - "Prod" builds by Releae Tag
  - [X] Do I even want to use KSP? This [[http://orbit.medphys.ucl.ac.uk/index.html][Orbiter Space flight simulator]] seems interesting:
    * Results: perhaps I'll work up to this at some point...
    * [[https://www.orbiterwiki.org/wiki/][Docs]]
    * [[https://www.orbiterwiki.org/wiki/SDK_documentation][SDK Docs]]
