README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-10 Thu 18:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Astra Docs and Planning</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tyler Weldon" />
<meta name="description" content="Astra is a mission control framework for KSP to facilitate fully automated missions and operations. Also hoping to learn a bit about control theory in the process."
 />
</head>
<body>
<div id="content">
<h1 class="title">Astra Docs and Planning</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org52e8f44">1. Astra</a>
<ul>
<li><a href="#org9ec39c5">1.1. <span class="todo STRT">STRT</span> R&amp;D <code>[2/2]</code></a></li>
<li><a href="#orgea7090e">1.2. <span class="todo STRT">STRT</span> Stage 1 - Prep <code>[2/5]</code></a></li>
<li><a href="#orgef1f5a5">1.3. <span class="todo TODO">TODO</span> Stage 2 - Data <code>[0/1]</code></a></li>
<li><a href="#org7e0687d">1.4. <span class="todo TODO">TODO</span> Stage 3 - RL Software integrations <code>[0/2]</code></a></li>
<li><a href="#orge4275aa">1.5. <span class="todo TODO">TODO</span> Stage 4 - Operations <code>[0/2]</code></a></li>
<li><a href="#orga249d45">1.6. <span class="todo TODO">TODO</span> Stage 5 - Stream Real Time Ops <code>[0/0]</code></a></li>
<li><a href="#orgf1c55ad">1.7. KSP Mod Requirements</a></li>
<li><a href="#orgc54052f">1.8. On Hold</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org52e8f44" class="outline-2">
<h2 id="org52e8f44"><span class="section-number-2">1</span> Astra</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9ec39c5" class="outline-3">
<h3 id="org9ec39c5"><span class="section-number-3">1.1</span> <span class="todo STRT">STRT</span> R&amp;D <code>[2/2]</code></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Can we set up a headless/graphically limited KSP?
<ul class="org-ul">
<li><del>Running KSP in a VM seems promising.</del>
<ul class="org-ul">
<li><del>Set all graphics settings to minimum</del></li>
</ul></li>
<li>We sure can! Unity options: <code>~KSP.x86_64 -batchmode -nographics~</code></li>
</ul></li>
<li class="on"><code>[X]</code> If not headless, can we automate the launching of KSP &ldquo;instances&rdquo;, and entering/setting up the game as desired(specific missions, locations, etc.) via the <a href="https://krpc.github.io/krpc/cpp/api/ui/ui.html">kRPC UI API</a>?
<ul class="org-ul">
<li><del>Might be able to use the Unity <a href="https://docs.unity3d.com/Manual/CLIBatchmodeCoroutines.html">Batch Mode</a> and <a href="https://docs.unity3d.com/Manual/CommandLineArguments.html">nographics</a> options to facilitate headless.</del></li>
<li><del>Will need some means of automatically launching specified game saves.</del>
<ul class="org-ul">
<li><del><a href="https://github.com/allista/AutoLoadGame">AutoLoadGame</a> might do the trick.</del>
<ul class="org-ul">
<li><del>Might modify to use Unity CLI args instead of config file:</del>
<ul class="org-ul">
<li><a href="https://answers.unity.com/questions/138715/read-command-line-arguments.html">https://answers.unity.com/questions/138715/read-command-line-arguments.html</a></li>
<li><a href="https://answers.unity.com/questions/366195/parameters-at-startup.html">https://answers.unity.com/questions/366195/parameters-at-startup.html</a></li>
</ul></li>
</ul></li>
</ul></li>
<li>No longer neccessary, headless is possible w/ unity opts in above task</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgea7090e" class="outline-3">
<h3 id="orgea7090e"><span class="section-number-3">1.2</span> <span class="todo STRT">STRT</span> Stage 1 - Prep <code>[2/5]</code></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Need to implement an automated Xvfb workflow using screenshots to debug Automation
<ul class="org-ul">
<li><del>There are module load errors in KSP.log, not sure if its preventing AutoLoadGame from doing its thing, or if that is related to the Changelog startup dialog in KSP Main Menu.</del> KSP 1.8.1 Works great</li>
<li><del>Why are we stuck at the Change Log dialog on KSP Start?</del> A bit annoying but appears to be inconsequential for my automation purposes.
<ul class="org-ul">
<li>ksp settings.cfg:
<ul class="org-ul">
<li>SHOW<sub>WHATSNEW</sub><sub>DIALOG</sub> = False</li>
<li><del>Version 1.7.3 was not honoring settings.cfg, lets see if 1.8.1 works</del> Still not honored in 1.8.1 but again, appears inconsequential</li>
</ul></li>
</ul></li>
</ul></li>
<li class="on"><code>[X]</code> Automate game-archiver</li>
<li class="trans"><code>[-]</code> Base VM Image(Packer) <code>[3/8]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> astra-base.sfs
<ul class="org-ul">
<li>Might need to hop into a graphical run to get the minimal base + mods setup</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> AutoLoadGame.conf</li>
<li class="off"><code>[&#xa0;]</code> settings.cfg</li>
<li class="off"><code>[&#xa0;]</code> krpc-settings.cfg</li>
<li class="on"><code>[X]</code> Install KSP 1.7.3 from S3</li>
<li class="trans"><code>[-]</code> Automate mod install <code>[3/4]</code>
<ul class="org-ul">
<li class="on"><code>[X]</code> Install CKAN.deb</li>
<li class="on"><code>[X]</code> kRPC manually from github</li>
<li class="on"><code>[X]</code> AutoLoadGame - Allista</li>
<li class="off"><code>[&#xa0;]</code> RO via CKAN</li>
<li class="off"><code>[&#xa0;]</code> Principia</li>
<li class="off"><code>[&#xa0;]</code> <a href="https://forum.kerbalspaceprogram.com/index.php?/topic/193933-110-kks-spacex-pack-july-06-2020/">KK&rsquo;s SpaceX Pack</a></li>
</ul></li>
<li class="on"><code>[X]</code> AutoLoadGame - Now supports specifying SFS files</li>
<li class="on"><code>[X]</code> POC kRPC</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Split Project into multiple repos <code>[0/3]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Terraform <code>[0/2]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Modules</li>
<li class="off"><code>[&#xa0;]</code> Plans</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Packer Base Image</li>
<li class="off"><code>[&#xa0;]</code> Astractl</li>
</ul></li>
<li class="on"><code>[X]</code> Choose kRPC client language - C++</li>
</ul>
</div>
</div>
<div id="outline-container-orgef1f5a5" class="outline-3">
<h3 id="orgef1f5a5"><span class="section-number-3">1.3</span> <span class="todo TODO">TODO</span> Stage 2 - Data <code>[0/1]</code></h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Set up client w/ all kRPC Data Stream - Once this is done, revisiting the image build will probably be worth it.
<ul class="org-ul">
<li>Pipe into GMAT and OpenMCT ???</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7e0687d" class="outline-3">
<h3 id="org7e0687d"><span class="section-number-3">1.4</span> <span class="todo TODO">TODO</span> Stage 3 - RL Software integrations <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://opensource.gsfc.nasa.gov/projects/GMAT/index.php">GMAT</a> - Planning</li>
<li class="off"><code>[&#xa0;]</code> <a href="https://github.com/nasa/openmct">OpenMCT</a> - Ops HUD</li>
</ul>
</div>
</div>
<div id="outline-container-orge4275aa" class="outline-3">
<h3 id="orge4275aa"><span class="section-number-3">1.5</span> <span class="todo TODO">TODO</span> Stage 4 - Operations <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li class="trans"><code>[-]</code> Starlink(s) <code>[0/0]</code></li>
<li class="trans"><code>[-]</code> Long running, real time ops <code>[0/0]</code></li>
</ul>
</div>
</div>
<div id="outline-container-orga249d45" class="outline-3">
<h3 id="orga249d45"><span class="section-number-3">1.6</span> <span class="todo TODO">TODO</span> Stage 5 - Stream Real Time Ops <code>[0/0]</code></h3>
</div>
<div id="outline-container-orgf1c55ad" class="outline-3">
<h3 id="orgf1c55ad"><span class="section-number-3">1.7</span> KSP Mod Requirements</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li><a href="https://github.com/allista/AutoLoadGame">AutoLoadGame</a> - by Allista, allows creating a configuration file in your saves dir that will automatically load the specified sfs file upong game start.</li>
<li><a href="https://krpc.github.io/krpc/">kRPC</a> - kRPC allows you to control Kerbal Space Program from scripts running outside of the game.</li>
<li><a href="https://github.com/KSP-RO/RealismOverhaul/wiki">Realism Overhaul</a> - Its not certain this will place nice with <a href="https://krpc.github.io/krpc/">kRPC</a>, however realistic(ish?) control theory is really the purpose of this project so we will proceed with it until/unless we encounter problems.</li>
<li><a href="https://ksp-kos.github.io/KOS/">kOS</a> - kOS might be useful for some simpler tasks where we don&rsquo;t want the full power of kRPC. Might use, might not. We&rsquo;ll see.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc54052f" class="outline-3">
<h3 id="orgc54052f"><span class="section-number-3">1.8</span> On Hold</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Properly version Packer builds
<ul class="org-ul">
<li>dev builds by commit short SHA</li>
<li>&ldquo;Prod&rdquo; builds by Releae Tag</li>
</ul></li>
<li class="on"><code>[X]</code> Do I even want to use KSP? This <a href="http://orbit.medphys.ucl.ac.uk/index.html">Orbiter Space flight simulator</a> seems interesting:
<ul class="org-ul">
<li>Results: perhaps I&rsquo;ll work up to this at some point&#x2026;</li>
<li><a href="https://www.orbiterwiki.org/wiki/">Docs</a></li>
<li><a href="https://www.orbiterwiki.org/wiki/SDK_documentation">SDK Docs</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tyler Weldon</p>
<p class="date">Created: 2020-09-10 Thu 18:12</p>
</div>
</body>
</html>
